{
    "Title": "A Noble Quest...",
    "Credits": "By Elliot Ahlstroem (kahlstro@ucsc.edu), based on template by Adam Smith (amsmith@ucsc.edu).",
    "InitialLocation": "Forest Path",
    "Locations": {
        "Forest Path": {
            "Body": "The forest path goes ever on.<br>Your legs are weary under the weight of your armor (if only that blasted horse had not run for the hills...), your stomach hungers for sustenance, and your throat burns with thirst.<br>But you must soldier forth. You are a knight, after all, and that sword won't find itself!<br><br>",
            "Choices": [
                {
                    "Text": "Onwards...",
                    "Target": "Murky Pond"
                }
            ]
        },
        "Murky Pond": {
            "Body": "<br>You follow the path through the trees, until it peters out, revealing...a pond! Perhaps you can quench your thirst.<br>But on further inspection, a layer of pond scum covers the water, and oily creatures are peeking up through the algae. Quenching seems to be out of the question.<br>You look up, and see a mass of grey peeking through the trees. It is ginormous!<br><br>",
            "Choices": [
                {
                    "Text": "Could it be...?",
                    "Target": "Fake Stone"
                }
            ]
        },
        "Fake Stone": {
            "Body": "<br>At last! The legendary Stone towers before you, glittering in the light peeking through the trees. Now, the sword...<br>You crest the boulder, ready for the moment of triumph, and--<br>There's no sword here! Hark, but you have been duped! This is just an ordinary rock!<br>You must keep going, no letting this discourage you.<br><br>",
            "Choices": [
                {
                    "Text": "Must keep searching...",
                    "Target": "Peaceful Clearing"
                }
            ]
        },
        "Peaceful Clearing": {
            "Body": "<br>The trees open up to a wide, grassy clearing, rounded by bushes full of--berries! Beautiful, red berries!<br>Finally, you may fill your belly with the gifts of the Earth! You don't recognize these berries, however, they may be poisonous...<br><br>",
            "Choices": [
                {
                    "Text": "Take some, what harm can it do?",
                    "Key": true,
                    "Target": "Fairy Grove"
                },
                {
                    "Text": "Not needed, they look...suspicious.",
                    "Key": false,
                    "Target": "Fairy Grove"
                }
            ]
        },
        "Fairy Grove": {
            "Body": "<br>You continue through the forest, the pouch full of berries reinvigorating your body and spirit.<br>A smattering of large mushrooms begin to creep up along the sides of the path. Are they...glittering?<br>Suddenly, a faerie appears in your field of vision! You thought these were mere works of fiction, but here is one right before you, in the flesh!<br><br>\"Who are you?!\" the faerie squeaks.<br>\"I am a noble knight, on a quest for the Sword in the Stone,\" you reply.<br>\"Well, if you're such a <i>noble knight</i>, where's your horse?\"<br>Rude little buggers. \"She ran off, I'll have you know.\"<br><br>The faerie gives a mischevious look. \"What a shame. If only someone could tell you where she is...for a price.\"<br>\"What kind of price?\" you sigh.<br>The faerie ponders for a second, then says: \"Ten berries.\"<br>You balk -- the fae are known for their unfair deals, this is a shocker! \"Just ten berries?\"<br>\"Yes.\"<br><br>",
            "Choices": [
                {
                    "Text": "Tis a shame! You have nothing to offer them...",
                    "Target": "Cave"
                },
                {
                    "Text": "Best to keep going, the fae are not to be trusted...",
                    "Target": "Cave"
                }
            ],
            "Locked_Choices": [
                {
                    "Text": "\"Why, I happen to have some!\"",
                    "Target": "Grass Field"
                },
                {
                    "Text": "Best to keep going, the fae are not to be trusted...",
                    "Target": "Cave"
                }
            ]
        },
        "Grass Field": {
            "Body": "<br>You hand over the berries, and the faerie screeches with delight.<br>\"Now, my horse?\" you prompt.<br>\"Yes, yes! First, you must go...\"<br><br>Following the faeries' directions, you walk a short distance until the trees disperse and reveal an expansive grass field, in the middle of which is standing...Your horse!<br>You run up to her and scratch her neck, before hoisting yourself into the saddle and riding onwards.<br><br>",
            "Choices": [
                {
                    "Text": "Show us the meaning of haste!",
                    "Target": "Babbling Brook"
                }
            ]
        },
        "Cave": {
            "Body": "<br>You trudge onwards out of the faerie grove, hoping you have not made a choice you will regret...<br>The night grows near. You hear the frogs and crickets singing their songs, and the prowling of hidden, surely dangerous, creatures. As the sun sets behind the horizon, you come upon a cave. That'll do just fine for shelter!<br>You settle in, unclasping your armor and laying down your sword for the night, and quickly fall into a deep slumber...<br><br>You wake to the feeling of...warm breath on your face.<br>Your eyes open slowly, and you are face to face with...a <i>bear</i>.<br><br>You do your best to relax, hoping to play dead so the beast will not tear you to shreds. Slow breaths. No sudden moves.<br>The bear sniffs over your body, then moves on to your belongings. It nudges your armor, until it finds your pouch full of berries. Of course, it's hungry! The bear scoops up your pouch of berries and lumbers off, content with its scavenged breakfast.<br><br>",
            "Choices": [
                {
                    "Text": "Carpe Diem, as they say!",
                    "Target": "Abandoned Hut"
                }
            ]
        },
        "Abandoned Hut": {
            "Body": "<br>You do not walk for long before you find a small cottage, hidden among the trees. Perhaps there will be a helpful soul residing there! You could get company, maybe a warm meal...Your stomach growls at the very thought.<br><br><i>Knock, knock, knock.</i><br><br>The door to the hut swings open, but curiously, there is no one behind it. Upon further inspection, it is long since abandoned. Dried, long-since rotted herbs and wares lay strewn across the tables, dozens of knick-knacks, covered in dust and cobwebs.<br><br><i>Slam!</i><br><br>The door shuts behind you, with a force unattributable to the wind. You whirl around, trying to see who pulled this trick on you, and come face to face with a withered, decrepit skeleton, decked in ragged robes and tarnished jewelry, in a rocking chair at the other end of the hut. Strange...she must have died here, long ago.<br>\"Sorry to disturb your rest,\" you murmur. \"I'll be on my way.\"<br>The skeleton seems to exhale a long, quiet sigh. The door swings back open, and you back out slowly, not wanting to disturb her anymore.<br><br>",
            "Choices": [
                {
                    "Text": "High time to get moving...",
                    "Target": "Babbling Brook"
                }
            ]
        },
        "Babbling Brook": {
            "Body": "<br>After nothing but trees for a long, long while, you finally hear the sound of rushing water. Finally, a chance to hydrate!<br>You jog towards the sound, elated at the chance to fill your waterskin again, and finally come to a clear, babbling brook, shining in the sunlight.<br>You kneel and fill up your waterskin, and splash your face with the cool, sweet water. You feel a sense of finality, of rest. Perhaps this harrowing quest will soon come to an end...<br><br>",
            "Locked_Body": "<br>After nothing but trees for a long, long while, you finally hear the sound of rushing water. Finally, a chance to hydrate!<br>You spur on your horse, elated at the chance to fill your waterskin again, and finally come to a clear, babbling brook, shining in the sunlight.<br>You dismount your mare, coming to a kneel and filling up your waterskin. You splash your face with the cool, sweet water. You feel a sense of finality, of rest. Perhaps this harrowing quest will soon come to an end...<br><br>",
            "Choices": [
                {
                    "Text": "Just a little bit more...",
                    "Target": "Sword in the Stone"
                }
            ]
        },
        "Sword in the Stone": {
            "Body": "<br>You walk onwards, the rushing water motivating you once again, head held high, until you finally see it: <i>the Sword in the Stone</i>.<br>You were duped before, but now there is no mistaking it. The Stone, rising to chest level, bears a tall, glittering sword in its heart, the trees parting around it as if out of respect.<br>You crest the Stone, and, as if sliding a knife out of butter, the Sword lands in your hand. You were truly worthy!<br>You raise the Sword, high above your head, and give a cry to the forest that had delayed this moment, delayed this <i>victory</i>.<br><br>Sword resting in its sheath, your spirits high, you finally begin the path home.<br><br>",
            "Locked_Body": "<br>You ride onwards, the rushing water motivating you, head held high, until you finally see it: <i>the Sword in the Stone</i>.<br>You were duped before, but now there is no mistaking it. The Stone, rising to chest level, bears a tall, glittering sword in its heart, the trees parting around it as if out of respect.<br>You dismount, and crest the Stone, and, as if sliding a knife out of butter, the Sword lands in your hand. You were truly worthy!<br>You raise the Sword, high above your head, and give a cry to the forest that had delayed this moment, delayed this <i>victory</i>.<br><br>Sword resting in its sheath, you mount your mare once again, and finally begin the path home.<br><br>"
        }
    }
}